dist/spcalendarpro.min.js

/* SPCalendarPro v1.2.5 | (c) 2018 samperrow https://sharepointhacks.com/sp-calendar-pro */ 
!function(e,t){e.spcalpro=function(){"use strict";var e;function t(e,t){return{begin:{beginDateTime:e,beginDate:new Date(e.toDateString()),beginTime:e.toTimeString()},end:{endDateTime:t,endDate:new Date(t.toDateString()),endTime:t.toTimeString()}}}a.prototype.isSameDate=function(){var e=this.userDateTimes.begin.beginDate,t=this.userDateTimes.end.endDate;return this.data=this.data.filter(function(r){return r.EventDate.toDateString()===e&&r.EndDate.toDateString()===t}),this},a.prototype.matchDateTimes=function(){var e=this.userDateTimes.begin.beginDateTime,t=this.userDateTimes.end.endDateTime;return this.data=this.data.filter(function(r){return r.EventDate<=e&&r.EndDate>=t}),this},a.prototype.isTimeConflict=function(){var e=this.userDateTimes.begin.beginDateTime,t=this.userDateTimes.end.endDateTime;return this.data=this.data.filter(function(r){var n=r.EventDate,a=r.EndDate;return e<=n&&t>=a||n<e&&a>e||n<t&&a>t||e<n&&t>a}),this},a.prototype.where=function(e){var t=e.split(" ")[0],r=e.split(" ")[1],n=e.split(r+" ")[1],a={"=":function(e,t){return e==t},">":function(e,t){return e>new Number(t)},"<":function(e,t){return e<new Number(t)},">=":function(e,t){return e>=new Number(t)},"<=":function(e,t){return e<=new Number(t)},"!=":function(e,t){return e!=t}};return this.data=this.data.filter(function(e){return a[r](e[t],n)}),this};var r=function(e,t,r,n){var a=void 0===t.async||t.async;function i(t){var r;4==t.readyState&&200==t.status?(!function(t){{if(t.responseXML)return e.data=s(t.responseXML.getElementsByTagName("*"));if(!t.responseXML&&t.responseText){var r=(n=t.responseText.replace(/&#22;|&#0;/g,""),window.ActiveXObject?new ActiveXObject("Microsoft.XMLDOM").loadXML(n):(new DOMParser).parseFromString(n,"application/xml"));return e.data=s(r.getElementsByTagName("*"))}}var n}(t),o()):500==t.status&&(r=t,e.error={errorCode:/<errorcode xmlns="http:\/\/schemas.microsoft.com\/sharepoint\/soap\/">/.test(r.responseText)?r.responseText.split('<errorcode xmlns="http://schemas.microsoft.com/sharepoint/soap/">')[1].split("</errorcode>")[0]:"",errorString:/<errorstring xmlns="http:\/\/schemas.microsoft.com\/sharepoint\/soap\/">/.test(r.responseText)?r.responseText.split('<errorstring xmlns="http://schemas.microsoft.com/sharepoint/soap/">')[1].split("</errorstring>")[0]:"",faultString:/<faultstring>/.test(r.responseText)?r.responseText.split("<faultstring>")[1].split("</faultstring>")[0]:""},console.error(e.error),e.error,o())}function s(t){for(var r=[],n=0;n<t.length;n++){var a={},i=t[n].attributes;if("z:row"===t[n].nodeName){for(var s=0;s<i.length;s++){var o=i[s].name.split("ows_")[1];a[o]="EventDate"===o||"EndDate"===o?new Date(i[s].value.replace(/-/g,"/")):i[s].value}r.push(a)}}return e.getEventsAfterDate&&(r=r.filter(function(t){return t.EventDate?t.EventDate>=e.getEventsAfterDate:t})),e.getEventsBeforeDate&&(r=r.filter(function(t){return t.EventDate?t.EventDate<=e.getEventsBeforeDate:t})),r}function o(){return t.callback?t.callback(e.data,e):e.userCallback?e.userCallback(e.data,e):e}return function(){var e="<soap:Envelope xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'><soap:Body><GetListItems xmlns='http://schemas.microsoft.com/sharepoint/soap/'><listName>"+t.listName+"</listName>",s="<DateRangesOverlap><FieldRef Name='EventDate'/><FieldRef Name='EndDate'/><FieldRef Name='RecurrenceID'/><Value Type='DateTime'><Year/></Value></DateRangesOverlap>",o="</Where><OrderBy><FieldRef Name='EventDate'/></OrderBy></Query></query><queryOptions><QueryOptions><RecurrencePatternXMLVersion>v3</RecurrencePatternXMLVersion><ExpandRecurrence>TRUE</ExpandRecurrence><RecurrenceOrderBy>TRUE</RecurrenceOrderBy><ViewAttributes Scope='RecursiveAll'/></QueryOptions></queryOptions>",u="",l=t.fields?function(){for(var e="calendar"===r?'<FieldRef Name="fRecurrence"/>':"",n=0;n<t.fields.length;n++)"string"==typeof t.fields[n]&&(e+="<FieldRef Name='"+t.fields[n]+"'/>");return e.length>0?"<viewFields><ViewFields>"+e+"</ViewFields></viewFields>":""}():"";t.CamlQuery?u=t.CamlQuery:"calendar"===r?u="single"===t.type?"<query><Query><Where><Eq><FieldRef Name='fRecurrence'/><Value Type='Number'>0</Value></Eq></Where></Query></query>":"recurring"===t.type?"<query><Query><Where><And><DateRangesOverlap><FieldRef Name='EventDate'/><FieldRef Name='EndDate'/><FieldRef Name='RecurrenceID'/><Value Type='DateTime'><Year/></Value></DateRangesOverlap><Eq><FieldRef Name='fRecurrence'/><Value Type='Number'>1</Value></Eq></And></Where><OrderBy><FieldRef Name='EventDate'/></OrderBy></Query></query><queryOptions><QueryOptions><RecurrencePatternXMLVersion>v3</RecurrencePatternXMLVersion><ExpandRecurrence>TRUE</ExpandRecurrence><RecurrenceOrderBy>TRUE</RecurrenceOrderBy><ViewAttributes Scope='RecursiveAll'/></QueryOptions></queryOptions>":"<query><Query><Where>"+s+o:"list"===r&&""===l&&(u="<viewFields><ViewFields></ViewFields></viewFields>");!function(e){var t=new XMLHttpRequest;t.open("POST",n.soapURL,a),t.setRequestHeader("X-Requested-With","XMLHttpRequest"),t.setRequestHeader("Content-Type",'text/xml;charset="utf-8"'),t.send(e),!0===a?t[t.onload?"onload":"onreadystatechange"]=function(){return i(t)}:i(t)}(e+(u+=l+"</GetListItems>")+"</soap:Body></soap:Envelope>")}(),e.data};String.prototype.formatInputToHours=function(){var e=this.split(" "),t=Number(e[0]);return"PM"===e[1]&&t<12?t+=12:t};function n(e){return e?"function"==typeof e.getMonth?e:new Date(e):null}function a(t,a){var i,s;return this.listName=t.listName?t.listName:null,this.getEventsAfterDate=n(t.getEventsAfterDate),this.getEventsBeforeDate=n(t.getEventsBeforeDate),this.fields=t.fields?t.fields:null,this.userDateTimes=t.userDateTimes?t.userDateTimes:null,this.CamlQuery=t.CamlQuery?t.CamlQuery:null,i=t.sourceSite,s=_spPageContextInfo.webUIVersion,e={year:15===s?"2013":"2010",soapURL:"string"==typeof i&&i.length>0?i+"/_vti_bin/Lists.asmx":15===s?_spPageContextInfo.webAbsoluteUrl+"/_vti_bin/Lists.asmx":document.location.protocol+"//"+document.location.host+_spPageContextInfo.webServerRelativeUrl+"/_vti_bin/Lists.asmx"},Array.prototype.filter||(Array.prototype.filter=function(e){if(void 0===this||null===this)throw new TypeError;var t=Object(this),r=t.length>>>0;if("function"!=typeof e)throw new TypeError;for(var n=[],a=arguments[1],i=0;i<r;i++)if(i in t){var s=t[i];e.call(a,s,i,t)&&n.push(s)}return n}),this.ready=function(e){this.userCallback=e},this.callback=function(){return t.callback?t.callback(this):null},"string"==typeof t.listName?this.data=r(this,t,a,e):console.error("You must specify a list name."),this}return{getCalendarEvents:function(e){return new a(e,"calendar")},getListItems:function(e){return new a(e,"list")},getDateTimesFromForm:function(e,r){var n=function(e,t){function r(e){var t=document.querySelectorAll('input[id$="DateTimeField_DateTimeFieldDate"]')[e].parentNode.parentNode,r=t.getElementsByClassName("ms-dttimeinput")[0];if(r)var n=r.getElementsByTagName("select")[0].value,a=r.getElementsByTagName("select")[1].value;return{date:t.getElementsByTagName("td")[0].getElementsByTagName("input")[0].value,time:function(){return n&&a?n.formatInputToHours()+":"+a:""}}}e=e||0,t=t||1;var n=r(e),a=r(t);return{userBeginDT:new Date(n.date+" "+n.time()),userEndDT:new Date(a.date+" "+a.time())}}(e,r);return t(n.userBeginDT,n.userEndDT)},userDates:function(e,r){return t(n(e),n(r))},disableDragAndDrop:function(){ExecuteOrDelayUntilScriptLoaded(function(){var e=SP.UI.ApplicationPages.CalendarContainerFactory.create;SP.UI.ApplicationPages.CalendarContainerFactory.create=function(t,r,n,a,i){if(r.dataSources&&r.dataSources instanceof Array&&r.dataSources.length>0)for(var s=0;s<r.dataSources.length;s++)r.dataSources[s].disableDrag=!0;e(t,r,n,a,i)}},"SP.UI.ApplicationPages.Calendar.js")}}}()}(this);